// Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2

int[] array = new int[4]; // Создаем массив из 4 элементов

        // Заполняем массив случайными положительными трехзначными числами
        Random random = new Random();
        for (int i = 0; i < array.Length; i++)
        {
            array[i] = random.Next(100, 1000);
        }

        int countEven = 0;

        // Подсчитываем количество четных чисел в массиве
        foreach (int number in array)
        {
            if (number % 2 == 0)
            {
                countEven++;
            }
        }

        Console.WriteLine("Количество четных чисел в массиве: " + countEven);